In [1]:
import pandas as pd

In [4]:
data=pd.read_csv('data.csv',dtype={'id':str , 'salary':float},)
data

     Name id   age  salary  EW  degree
0     Ali  2    32  1000.0   3       3
1    Reza  3    26   800.0   2       2
2    Mina  4  1200    35.0   8       3
3   Javad  5    23   500.0   1       1
4    Nima  6    36  2000.0  10       4
5  Maryam  7    30  1400.0   5       2

In [5]:
data.describe()

               age       salary         EW    degree
count     6.000000     6.000000   6.000000  6.000000
mean    224.500000   955.833333   4.833333  2.500000
std     477.917043   688.406977   3.544949  1.048809
min      23.000000    35.000000   1.000000  1.000000
25%      27.000000   575.000000   2.250000  2.000000
50%      31.000000   900.000000   4.000000  2.500000
75%      35.000000  1300.000000   7.250000  3.000000
max    1200.000000  2000.000000  10.000000  4.000000

In [6]:
type(data)

pandas.core.frame.DataFrame

In [7]:
data.head()

    Name id   age  salary  EW  degree
0    Ali  2    32  1000.0   3       3
1   Reza  3    26   800.0   2       2
2   Mina  4  1200    35.0   8       3
3  Javad  5    23   500.0   1       1
4   Nima  6    36  2000.0  10       4

In [9]:
data.tail(3)

     Name id  age  salary  EW  degree
3   Javad  5   23   500.0   1       1
4    Nima  6   36  2000.0  10       4
5  Maryam  7   30  1400.0   5       2

In [10]:
data.iloc[2]

Name      Mina
id           4
age       1200
salary    35.0
EW           8
degree       3
Name: 2, dtype: object

In [11]:
data.iloc[2:4]

    Name id   age  salary  EW  degree
2   Mina  4  1200    35.0   8       3
3  Javad  5    23   500.0   1       1

In [12]:
data['age']

0      32
1      26
2    1200
3      23
4      36
5      30
Name: age, dtype: int64

In [13]:
data['age'][2]

1200

In [15]:
data[ ['Name','salary'] ]

     Name  salary
0     Ali  1000.0
1    Reza   800.0
2    Mina    35.0
3   Javad   500.0
4    Nima  2000.0
5  Maryam  1400.0

In [16]:
data.columns

Index(['Name', 'id', 'age', 'salary', 'EW', 'degree'], dtype='object')

In [18]:
data.columns[2]

'age'

In [21]:
data['age'].mean()

224.5

In [23]:
data.age.std()

477.9170430106045

In [24]:
data2=data.drop('age',axis=1)
data2

     Name id  salary  EW  degree
0     Ali  2  1000.0   3       3
1    Reza  3   800.0   2       2
2    Mina  4    35.0   8       3
3   Javad  5   500.0   1       1
4    Nima  6  2000.0  10       4
5  Maryam  7  1400.0   5       2

In [25]:
data2=data2.drop([1],axis=0)
data2

     Name id  salary  EW  degree
0     Ali  2  1000.0   3       3
2    Mina  4    35.0   8       3
3   Javad  5   500.0   1       1
4    Nima  6  2000.0  10       4
5  Maryam  7  1400.0   5       2

In [27]:
data2.to_csv('data2.csv',index=None)